test_citation.org
#+TITLE: Teste
#+AUTHOR: Gabe
#+BIBLIOGRAPHY: library plain


* Training

To succesfully create pdfs with citations from org-export-dispatch, you have to change the variable `org-latex-pdf-process` to use latexmk instead of latex, as described in  [[https://github.com/jkitchin/org-ref/issues/346][_this link_]].

In *doom emacs*, you can change this variable in ~/.doom.d/custom.el

Citing here. \cite{Wirthlin2018}

Citing again. \cite{Vieira2019,Valdez-Velazquez2020,Zhang2014}

\bibliography{library}
\bibliographystyle{plain}
